# LEET CODE
## Problem-1731: The Number of Employees Which Report to Each Employee
Class: Easy

Source: https://leetcode.com/problems/the-number-of-employees-which-report-to-each-employee

## Description
Table: Employees
| Column Name | Type     |
|-------------|----------|
| employee_id | int      |
| name        | varchar  |
| reports_to  | int      |
| age         | int      |

- employee_id is the primary key for this table.
- This table contains information about the employees and the id of the manager they report to. Some employees do not report to anyone (reports_to is null). 

## To Do
For this problem, we will consider a manager an employee who has at least 1 other employee reporting to them.

Write an SQL query to report the ids and the names of all managers, the number of employees who report directly to them, and the average age of the reports rounded to the nearest integer.

Return the result table ordered by employee_id.

The query result format is in the following example.

## Example

Input: 

Employees table:
| employee_id | name    | reports_to | age |
|-------------|---------|------------|-----|
| 9           | Hercy   | null       | 43  |
| 6           | Alice   | 9          | 41  |
| 4           | Bob     | 9          | 36  |
| 2           | Winston | null       | 37  |

Output: 
| employee_id | name  | reports_count | average_age |
|-------------|-------|---------------|-------------|
| 9           | Hercy | 2             | 39          |

- Explanation: Hercy has 2 people report directly to him, Alice and Bob. Their average age is (41+36)/2 = 38.5, which is 39 after rounding it to the nearest integer.

## Importing

In [1]:
import pandas as pd
from pandasql import sqldf

## Define Schema

In [2]:
data = {
    'employee_id': [9, 6, 4, 2],
    'name': ['Hercy', 'Alice', 'Bob', 'Winston'],
    'reports_to': [None, 9, 9, None],
    'age': [43, 41, 36, 37]
}

Employees = pd.DataFrame(data)

Employees

   employee_id     name  reports_to  age
0            9    Hercy         NaN   43
1            6    Alice         9.0   41
2            4      Bob         9.0   36
3            2  Winston         NaN   37

## Task

In [19]:
# Define the SQL query
query = """
SELECT emp.employee_id, name, reports_count, average_age
FROM (
    SELECT 
        reports_to AS employee_id, 
        COUNT(DISTINCT employee_id) AS reports_count, 
        ROUND(AVG(age),0) AS average_age
    FROM Employees
    GROUP BY reports_to
    HAVING reports_to IS NOT NULL
) AS emp
LEFT JOIN Employees USING(employee_id)
ORDER BY employee_id
;
"""

# Excute the query using pandasql
result = sqldf(query, env={'Employees':Employees})

# Display the result dataframe
display(result)

   employee_id   name  reports_count  average_age
0          9.0  Hercy              2         39.0